{
  "title": "José Fortún CV",
  "lang-es": "Español",
  "lang-en": "Inglés",
  "language-selector-label": "Seleccionar idioma",
  "profile": "Perfil",
  "job-title": "Desarrollador de Software",
  "location": "Andalucía, España",
  "bio-1": "Soy técnico superior en Desarrollo de Aplicaciones Multiplataforma y estudio Ingeniería del Software.",
  "bio-2": "Actualmente trabajo como desarrollador de software enfocado principalmente en el backend, programando en Java y utilizando el framework Spring. Tengo experiencia en proyectos para clientes de empresas tanto públicas como privadas, usando la metodología Scrum/Agile y las última tecnologías del ámbito del backend tales como Spring WebFlux, Spring Cloud Stream y Kafka entre otras.",
  "bio-3": "Mis vocaciones son la programación y la tecnología. Me encanta adquirir nuevos conocimientos, trabajar en equipo y solucionar problemas y me considero una persona proactiva, eficiente y organizada, que trabaja bien bajo presión.",
  "skills": "Habilidades",
  "languages": "Idiomas",
  "spanish": "Español",
  "spanish-level": "Nativo",
  "english": "Inglés",
  "english-level": "Fluido",
  "work-experience": "Experiencia de trabajo",
  "senior-dev-realnaut": "Desarrollador de software sénior en Realnaut",
  "senior-dev-sngular": "Desarrollador de software sénior en Sngular",
  "dev": "Desarrollador de software en Deloitte",
  "currently": "Actualmente",
  "education": "Educación",
  "software-engineering": "Ingeniería del Software",
  "multiplatform-app-dev": "GS Desarrollo de Aplicaciones Multiplataforma",
  "microcomputer-systems": "GM Sistemas Microinformáticos y Redes",
  "studying": "Cursando",
  "month-january": "Enero",
  "month-february": "Febrero",
  "month-march": "Marzo",
  "month-april": "Abril",
  "month-may": "Mayo",
  "month-june": "Junio",
  "month-july": "Julio",
  "month-august": "Agosto",
  "month-september": "Septiembre",
  "month-october": "Octubre",
  "month-november": "Noviembre",
  "month-december": "Diciembre",
  "date-realnaut": "Julio 2024 - Actualmente",
  "date-sngular": "Octubre 2022 - Julio 2024",
  "date-deloitte": "Noviembre 2020 - Octubre 2022",
  "date-software-eng": "Septiembre 2021 - Cursando",
  "date-multiplatform": "Septiembre 2019 - Junio 2021",
  "date-microcomputer": "Septiembre 2017 - Junio 2019",
  "projects": "Proyectos",
  "project-inditex-description": "Proyecto internacional para la empresa privada \"Inditex\" en el que trabajo como desarrollador backend en el rol de ingeniero de staff, utilizando programación funcional y reactiva además de streaming de datos con Kafka.",
  "project-inditex-technologies": "Tecnologías: Java 21, Spring Boot, Spring WebFlux, Spring Data, Spring Cloud Stream, Kafka, gRPC, microservicios, contenedores, Azure, PostgreSQL, Git, Arquitectura Hexagonal, Domain Driven Design.",
  "project-decathlon-description": "Proyecto internacional para la empresa privada \"Decathlon\" en el que trabajo como desarrollador backend utilizando programación funcional y reactiva.",
  "project-decathlon-technologies": "Tecnologías: Java 21, Spring Boot, Spring WebFlux, Spring Cloud Stream, Kafka, Kafka Streams, gRPC, microservicios, contenedores, Google Cloud Platform, Git.",
  "project-mytax-description": "Proyecto internacional para la fiscalidad de Bruselas en el que trabajé en el desarrollo backend de 9 impuestos en la plataforma MyTax, cuyas características incluyen pagos en línea, declaraciones y documentos entre otros.",
  "project-mytax-technologies": "Tecnologías: Java 17, Spring Boot, JSP, arquitectura monolítica, SQL, SAP eCommerce, Git.",
  "project-elcorteingles-description": "Proyecto nacional para la empresa privada \"El Corte Inglés\" desarrollando microservicios siguiendo la metodología API First y utilizando el estándar OpenAPI.",
  "project-elcorteingles-technologies": "Tecnologías: Java 11, Spring Boot, Spring MVC, Spring Data JPA, SQL, microservicios, contenedores, OpenAPI, Git.",
  "project-renfe-description": "Proyecto nacional para la empresa pública ferroviaria \"Renfe\" desarrollando el backend y frontend del sistema de pago online.",
  "project-renfe-technologies": "Tecnologías: Java 8, Spring, JSP, SQL, arquitectura monolítica, Git."
}
